poc/results/x-cross/chaos/crdb-vm-6node-P-B-aa-rc-20260810T152835+0800-chaos/scenarioC7/fio-summary.txt
chaos-c7-contention: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=64
...
fio-3.19
Starting 4 processes
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
chaos-c7-contention: Laying out IO file (1 file / 2048MiB)
[...]

chaos-c7-contention: (groupid=0, jobs=4): err= 0: pid=5539: Mon Aug 10 21:33:07 2026
  write: IOPS=37.0k, BW=145MiB/s (152MB/s)(4342MiB/30024msec); 0 zone resets
    slat (nsec): min=1463, max=90800k, avg=80721.36, stdev=1659790.52
    clat (usec): min=222, max=117571, avg=6832.00, stdev=14270.80
     lat (usec): min=225, max=117579, avg=6912.83, stdev=14348.65
    clat percentiles (usec):
     |  1.00th=[   515],  5.00th=[   725], 10.00th=[   906], 20.00th=[  1172],
     | 30.00th=[  1450], 40.00th=[  1876], 50.00th=[  2900], 60.00th=[  3687],
     | 70.00th=[  4359], 80.00th=[  5342], 90.00th=[  8291], 95.00th=[ 46400],
     | 99.00th=[ 69731], 99.50th=[ 71828], 99.90th=[ 80217], 99.95th=[ 86508],
     | 99.99th=[108528]
   bw (  KiB/s): min=84627, max=335803, per=99.64%, avg=147549.29, stdev=9872.10, samples=236
   iops        : min=21156, max=83950, avg=36887.20, stdev=2468.02, samples=236
  lat (usec)   : 250=0.01%, 500=0.84%, 750=4.86%, 1000=7.56%
  lat (msec)   : 2=28.51%, 4=22.64%, 10=26.91%, 20=1.74%, 50=2.28%
  lat (msec)   : 100=4.63%, 250=0.02%
  cpu          : usr=0.99%, sys=5.24%, ctx=88917, majf=0, minf=52
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=0,1111547,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
  WRITE: bw=145MiB/s (152MB/s), 145MiB/s-145MiB/s (152MB/s-152MB/s), io=4342MiB (4553MB), run=30024-30024msec

Disk stats (read/write):
  sda: ios=1259/1435173, merge=0/70354, ticks=1091/1382569, in_queue=1383660, util=32.08%